# Pandas DataFrame Operation Summary

In [1]:
import pandas as pd

## 1. Create DataFrame from Python Dictionary

Dictionary keys -> columns of DataFrame <br>
Dictionary values in list -> rows of DataFrame

In [136]:
data1 = {'Name': ['Joey Pasta'],
        'School': ['Hello']}

df1 = pd.DataFrame(data1)
df1.head()

         Name School
0  Joey Pasta  Hello

In [137]:
data2 = {'Date': ['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
       'Event': ['Music', 'Poetry', 'Theatre', 'Comedy'], 
        'Cost': [10000, 5000, 15000, 2000]}

df2 = pd.DataFrame(data2)
df2.head(10)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

## 2. Add New Columns into DataFrame

In [138]:
df2['Location'] = ['Madrid', 'New York', 'LA', 'London']
df2.head(10)

        Date    Event   Cost  Location
0  10/2/2011    Music  10000    Madrid
1  11/2/2011   Poetry   5000  New York
2  12/2/2011  Theatre  15000        LA
3  13/2/2011   Comedy   2000    London

In [139]:
df2['NumGuest'], df2['Performer'] = [10, 20, 30, 40], ['John', 'Patrick', 'Sam', 'Adel']
df2.head(10)

        Date    Event   Cost  Location  NumGuest Performer
0  10/2/2011    Music  10000    Madrid        10      John
1  11/2/2011   Poetry   5000  New York        20   Patrick
2  12/2/2011  Theatre  15000        LA        30       Sam
3  13/2/2011   Comedy   2000    London        40      Adel

## 3. Remove Columns from DataFrame

In [140]:
df2 = df2.drop(columns=['Performer'])
df2.head(10)

        Date    Event   Cost  Location  NumGuest
0  10/2/2011    Music  10000    Madrid        10
1  11/2/2011   Poetry   5000  New York        20
2  12/2/2011  Theatre  15000        LA        30
3  13/2/2011   Comedy   2000    London        40

In [2]:
df2 = df2.drop(columns=['Cost', 'NumGuest'])
df2.head(10)

NameError: name 'df2' is not defined

## 4. Rename Column Names with Python Dictionary

In [142]:
# Rename Event Column to Genre Column
# We can rename multiple columns using python dictionary

df2 = df2.rename(columns={'Event': 'Genre'})
df2.head(10)

        Date    Genre  Location
0  10/2/2011    Music    Madrid
1  11/2/2011   Poetry  New York
2  12/2/2011  Theatre        LA
3  13/2/2011   Comedy    London

## 5. Append Rows into DataFrame

In [143]:
newData = {'Date': '15/2/2011', 'Genre': 'K-Pop'}
df2 = df2.append(newData, ignore_index=True)
df2.head(10)

        Date    Genre  Location
0  10/2/2011    Music    Madrid
1  11/2/2011   Poetry  New York
2  12/2/2011  Theatre        LA
3  13/2/2011   Comedy    London
4  15/2/2011    K-Pop       NaN

In [144]:
df3 = pd.DataFrame({'Date': ['10/3/2012', '11/3/2012'],
                    'Genre': ['Mathematics', 'Physics'],
                   'Location': ['Japan', 'Spain']})
df3.head(10)

        Date        Genre Location
0  10/3/2012  Mathematics    Japan
1  11/3/2012      Physics    Spain

## 6. Concatenate DataFrames

In [145]:
concated = pd.concat([df2,df3], ignore_index=True)
concated.head(10)

        Date        Genre  Location
0  10/2/2011        Music    Madrid
1  11/2/2011       Poetry  New York
2  12/2/2011      Theatre        LA
3  13/2/2011       Comedy    London
4  15/2/2011        K-Pop       NaN
5  10/3/2012  Mathematics     Japan
6  11/3/2012      Physics     Spain

In [146]:
df4 = pd.DataFrame({'Gender': ['Male', 'Female'],
                   'School': ['China', 'England']})
df4.head()

   Gender   School
0    Male    China
1  Female  England

In [147]:
tryconcat = pd.concat([concated,df4], ignore_index=True)
tryconcat.head(20)

        Date        Genre  Location  Gender   School
0  10/2/2011        Music    Madrid     NaN      NaN
1  11/2/2011       Poetry  New York     NaN      NaN
2  12/2/2011      Theatre        LA     NaN      NaN
3  13/2/2011       Comedy    London     NaN      NaN
4  15/2/2011        K-Pop       NaN     NaN      NaN
5  10/3/2012  Mathematics     Japan     NaN      NaN
6  11/3/2012      Physics     Spain     NaN      NaN
7        NaN          NaN       NaN    Male    China
8        NaN          NaN       NaN  Female  England

## 7. Remove Rows from DataFrame

In [148]:
tryconcat = tryconcat.drop([0,1,5], axis=0)
tryconcat.head(20)

        Date    Genre Location  Gender   School
2  12/2/2011  Theatre       LA     NaN      NaN
3  13/2/2011   Comedy   London     NaN      NaN
4  15/2/2011    K-Pop      NaN     NaN      NaN
6  11/3/2012  Physics    Spain     NaN      NaN
7        NaN      NaN      NaN    Male    China
8        NaN      NaN      NaN  Female  England

In [149]:
tryconcat = tryconcat[3:]
tryconcat.head(20)

        Date    Genre Location  Gender   School
6  11/3/2012  Physics    Spain     NaN      NaN
7        NaN      NaN      NaN    Male    China
8        NaN      NaN      NaN  Female  England

In [150]:
tryconcat = tryconcat[0:2]
tryconcat.head()

        Date    Genre Location Gender School
6  11/3/2012  Physics    Spain    NaN    NaN
7        NaN      NaN      NaN   Male  China

## 8. Set Index

In [151]:
tryconcat.set_index('Date', inplace=True)

In [152]:
tryconcat.head()

             Genre Location Gender School
Date
11/3/2012  Physics    Spain    NaN    NaN
NaN            NaN      NaN   Male  China

In [153]:
tryconcat = tryconcat.drop('11/3/2012', axis=0)
tryconcat.head()

     Genre Location Gender School
Date
NaN    NaN      NaN   Male  China

## 9. loc & iloc with Index

In [8]:
data = {'Date': ['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
       'Event': ['Music', 'Poetry', 'Theatre', 'Comedy'], 
        'Cost': [10000, 5000, 15000, 2000]}

df = pd.DataFrame(data)
df.set_index('Date', inplace=True)
df.head(10)

             Event   Cost
Date
10/2/2011    Music  10000
11/2/2011   Poetry   5000
12/2/2011  Theatre  15000
13/2/2011   Comedy   2000

In [9]:
df.iloc[:3,1]

Date
10/2/2011    10000
11/2/2011     5000
12/2/2011    15000
Name: Cost, dtype: int64

In [16]:
df.loc['12/2/2011','Event']

'Theatre'

In [11]:
df.loc['11/2/2011', 'Cost']

5000

In [12]:
df.iloc[:2,0]

Date
10/2/2011     Music
11/2/2011    Poetry
Name: Event, dtype: object

## 10. GroupBy Operation

In [18]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America
6,Argentina,193,25,221,8.3,South America
7,Armenia,21,179,11,3.8,Europe
8,Australia,261,72,212,10.4,Oceania
9,Austria,279,75,191,9.7,Europe

In [19]:
## What's the average beer servings across all countries?

drinks['beer_servings'].mean()

drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

## What's the average beer servings by continents? (between Asia, Europe, Africa, NA, etc.)

filtering the data by continent <br>
We can use groupby method when we want to analyze groups of data by some categories <br>
For each continent, what's the mean of beer servings?

In [20]:
drinks.groupby('continent')['beer_servings'].mean()

drinks[drinks['continent'] == 'Africa']['beer_servings'].mean()

drinks[drinks['continent'] == 'Asia']['beer_servings'].mean()

drinks[drinks['continent'] == 'Europe']['beer_servings'].mean()

drinks[drinks['continent'] == 'North America']['beer_servings'].mean()

drinks[drinks['continent'] == 'Oceania']['beer_servings'].mean()

drinks[drinks['continent'] == 'South America']['beer_servings'].mean()

175.08333333333334

### 10-2Calculate means of all of numeric columns

In [ ]:
drinks.groupby('continent').mean()

%matplotlib inline

drinks.groupby('continent').mean().plot(kind='bar')

In [ ]:

## aggregate method

drinks.groupby('continent')['beer_servings'].agg(['count', 'min', 'max', 'mean'])